print("Введите координаты первой точки: ")
x1 = int(input("x1 = "))
y1 = int(input("y1 = "))
print("Введите координаты второй точки: ")
x2 = int(input("x2 = "))
y2 = int(input("y2 = "))
print("Введите координаты третьей точки: ")
x3 = int(input("x3 = "))
y3 = int(input("y3 = "))
a = ((x1-x2)**2 + (y1-y2)**2)**0.5
b = ((x1-x3)**2 + (y1-y3)**2)**0.5
c = ((x3-x2)**2 + (y3-y2)**2)**0.5
if a + b > c and a + c > b and c + b > a:
    if a == b == c:
        print("Треугольник равносторонний")
    elif a == c or a == b or b == c:
        print('Треугольник равнобедренный')
    else:
        print("Треугольник разносторонний")
else:
    print("Треугольника не существует")